KanatERPSukhova.КанатАдаптация/src/Documents/ЭтапПроизводства2_2/ЭтапПроизводства2_2.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="03503ac6-a4b9-4d70-b0ef-949dac7b8de4">
  <name>ЭтапПроизводства2_2</name>
  <objectBelonging>Adopted</objectBelonging>
  <registerRecords>AccumulationRegister.КАНАТ_СоответствиеГрупповыхУпаковокСериямНоменклатуры</registerRecords>
  <attributes>
    <name>КАНАТ_КомментарийКЗаказу</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КАНАТ_Сертификат</name>
    <type>
      <types>CatalogRef.КАНАТ_Сертификаты</types>
    </type>
  </attributes>
  <attributes extendedConfigurationObject="49fb8c7a-a984-433d-9013-98b3f1808eba">
    <name>Статус</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="0662487e-07e7-4fe3-b008-ffb293a9f154">
    <name>Спецификация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="38ea66f4-5bfa-48f1-8431-a99d27fcf31d">
    <name>ДатаПроизводства</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <tabularSections extendedConfigurationObject="dc035f49-1f37-4bf6-a369-751f132442a2">
    <name>ВыходныеИзделия</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>КАНАТ_КомментарийКЗаказу</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>400</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КАНАТ_Сертификат</name>
      <type>
        <types>CatalogRef.КАНАТ_Сертификаты</types>
      </type>
    </attributes>
    <attributes extendedConfigurationObject="20aa6e93-6a18-4526-830f-8d45d3e04bb6">
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="5d7b896b-c4b4-4604-9f9b-3b0fcf1196e3">
      <name>Характеристика</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="42da4e01-6f2b-447f-a8ce-82c02d461afd">
      <name>КоличествоУпаковок</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="691cd7ff-4cd5-4d21-a6a6-32338ca8eb43">
      <name>Упаковка</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
  <tabularSections extendedConfigurationObject="3a4b1c3c-2a58-45b8-bea3-df1e63deaecc">
    <name>РасходМатериаловИРабот</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="f770e39d-256e-4caa-a806-c8d8fbdc962b">
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="4bfa3470-ec68-4384-ab44-61dc34f81542">
      <name>Количество</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="c2a5e8ce-e0dd-4c5e-bacb-a38121ee5440">
      <name>КоличествоУпаковок</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="ca22f78a-e6c7-4d0a-abdf-dafcd0e7e8ca">
      <name>ИдентификаторСтроки</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>36</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
</mdclass:Document>

KanatERPSukhova.КанатАдаптация/src/Enums/СтатусыЭтаповПроизводства2_2/СтатусыЭтаповПроизводства2_2.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="f8cfe6b7-a92d-45f1-bd06-9154e8657466">
  <name>СтатусыЭтаповПроизводства2_2</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues extendedConfigurationObject="624549dd-c62a-4621-8d54-8985090c24f8">
    <name>Завершен</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="30315e1e-ef69-44aa-82df-31e95312033f">
    <name>Начат</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="30999900-35cb-4f64-910e-b40ff9f11e9d">
    <name>КВыполнению</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="123e13cc-3c7a-42e9-9645-235a36063cce">
    <name>Сформирован</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="2a510fff-5969-44b4-b424-26586b66907d">
    <name>Формируется</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

KanatERPSukhova.КанатАдаптация/src/Documents/ДвижениеПродукцииИМатериалов/ДвижениеПродукцииИМатериалов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="6b652820-7672-43f5-a265-2bed82a309a6">
  <name>ДвижениеПродукцииИМатериалов</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="fd2d4467-c99a-4ae0-9d0c-18b83c88da0a">
    <name>ХозяйственнаяОперация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="3f53c0f1-28e1-4b6c-bf6d-4ee84e53f2e7">
    <name>Получатель</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="86ff623a-1439-42bc-865c-6d1a6f2310ef">
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="580adfdd-4e0f-429d-a6b6-26bbd1c484ae">
    <name>Отправитель</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections extendedConfigurationObject="6cc3a6d7-54b4-4e21-af19-24297ed6494a">
    <name>Товары</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="a24a1454-023d-4c52-b65c-48eac9aa6b26">
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:Document>

KanatERPSukhova.КанатАдаптация/src/Documents/РасходныйОрдерНаТовары/РасходныйОрдерНаТовары.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="e5b57481-c7d7-459c-8f38-003976928dcf">
  <name>РасходныйОрдерНаТовары</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes>
    <name>КАНАТ_ВсегоСерий</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections extendedConfigurationObject="f93cbc89-602b-4c37-a90c-1bceda80afe7">
    <name>ТоварыПоРаспоряжениям</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>КАНАТ_КомментарийКЗаказу</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>400</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КАНАТ_Сертификат</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections extendedConfigurationObject="389dae2c-5f04-4c10-8555-7103bd0c3f21">
    <name>ОтгружаемыеТовары</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>КАНАТ_КомментарийКЗаказу</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>400</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КАНАТ_Сертификат</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes extendedConfigurationObject="152a5a3e-8c56-4983-9052-b8b75a6e0d12">
      <name>КоличествоУпаковок</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="93ae14aa-f407-4566-96ba-2cbba0eadcc2">
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="26cd1a83-599c-4cb2-88f4-8da57cd2dfaf">
      <name>Характеристика</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:Document>

KanatERPSukhova.КанатАдаптация/src/Documents/ЗаказНаПроизводство2_2/ЗаказНаПроизводство2_2.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="04b45cc8-19da-4fc2-ab25-fcf16e66f5ee">
  <name>ЗаказНаПроизводство2_2</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="f1e30099-86a8-4d01-b947-c8d4e48da517">
    <name>ДокументОснование</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections extendedConfigurationObject="0190487c-4b35-4793-bebb-cdc5d67bf079">
    <name>Продукция</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>КАНАТ_КомментарийКЗаказу</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>400</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КАНАТ_Сертификат</name>
      <type>
        <types>CatalogRef.КАНАТ_Сертификаты</types>
      </type>
    </attributes>
    <attributes extendedConfigurationObject="dd131bed-f4cf-4ccb-8427-639b59bd5bf2">
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:Document>

KanatERPSukhova.КанатАдаптация/src/Documents/ЭтапПроизводства2_2/ManagerModule.bsl
//&Вместо("ПродукцияИПолуфабрикатыДляФормированияЭтапов")
//Функция КАНАТ_ПродукцияИПолуфабрикатыДляФормированияЭтапов(МенеджерВременныхТаблиц)
//	Запрос = Новый Запрос(
//	"ВЫБРАТЬ
//	|	Таблица.Распоряжение КАК Распоряжение,
//	|	
//	|	Таблица.НазначениеПродукция КАК НазначениеПродукция,
//	|	Таблица.НазначениеМатериалы КАК НазначениеМатериалы,
//	|	
//	|	Таблица.Номенклатура   КАК Номенклатура,
//	|	Таблица.Характеристика КАК Характеристика,
//	|
//	|	Таблица.Отправитель    КАК Отправитель,
//	|	Таблица.Получатель     КАК Получатель,
//	|	
//	|	Таблица.ЭтапИсточник   КАК ЭтапИсточник,
//	|	Таблица.Назначение     КАК Назначение,
//	|	
//	|	Таблица.Спецификация   КАК Спецификация,
//	|
//	|	Таблица.СписатьНаРасходы         КАК СписатьНаРасходы,
//	|	Таблица.СтатьяРасходов           КАК СтатьяРасходов,
//	|	Таблица.АналитикаРасходов        КАК АналитикаРасходов,
//	|	Таблица.АналитикаАктивовПассивов КАК АналитикаАктивовПассивов,
//	|	
//	|	Таблица.НомерСтроки    КАК НомерСтроки,
//	|	
//	|	Таблица.Количество     КАК Количество,
//	|	
//	|	ВЫРАЗИТЬ(Таблица.Распоряжение КАК Документ.ЗаказНаПроизводство2_2).НачатьНеРанее           КАК ДатаЗапуска,
//	|	ВЫРАЗИТЬ(Таблица.Распоряжение КАК Документ.ЗаказНаПроизводство2_2).ДатаПотребности         КАК ДатаВыпуска,
//	|	ВЫРАЗИТЬ(Таблица.Распоряжение КАК Документ.ЗаказНаПроизводство2_2).РазмещениеВыпуска       КАК РазмещениеВыпуска,
//	|	ВЫРАЗИТЬ(Таблица.Распоряжение КАК Документ.ЗаказНаПроизводство2_2).НаправлениеДеятельности КАК НаправлениеДеятельности,
//	|	ВЫРАЗИТЬ(Таблица.Распоряжение КАК Документ.ЗаказНаПроизводство2_2).Подразделение           КАК ПодразделениеДиспетчер,
//	|
//	|	Таблица.ЭтапИсточник <> ЗНАЧЕНИЕ(Документ.ЭтапПроизводства2_2.ПустаяСсылка)                КАК ОбособитьПодРазобрку,
//	|//++ Гурьев 13.09.23 Добавление комментария к заказу
//	|	ЕСТЬNULL(Продукция.КАНАТ_КомментарийКЗаказу, """") КАК КАНАТ_КомментарийКЗаказу,
//	|	ЕСТЬNULL(Продукция.КАНАТ_Сертификат, """") КАК КАНАТ_Сертификат
//	|//-- Гурьев 13.09.23
//	|ИЗ
//	|	ВтДанныеДляФормированияЭтапов КАК Таблица
//	|//++ Гурьев 13.09.23 Добавление комментария к заказу
//	|	ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаказНаПроизводство2_2.Продукция КАК Продукция
//	|	ПО (Продукция.Ссылка = Таблица.Распоряжение
//	|		И Продукция.НомерСтроки = Таблица.НомерСтроки)
//	|//-- Гурьев 13.09.23
//	|	
//	|ГДЕ
//	|	Таблица.Спецификация <> ЗНАЧЕНИЕ(Справочник.РесурсныеСпецификации.ПустаяСсылка)
//	|");
//	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
//	
//	Возврат Запрос.Выполнить().Выгрузить();
//	
//КонецФункции

&ИзменениеИКонтроль("ДобавитьКомандыСозданияНаОсновании")
Процедура КАНАТ_ДобавитьКомандыСозданияНаОсновании(КомандыСозданияНаОсновании, Параметры)

	Документы.ВыработкаСотрудников.ДобавитьКомандуСоздатьНаОснованииСозданиеВыработкиСотрудников(КомандыСозданияНаОсновании);
    #Удаление
	Команда = Документы.ДвижениеПродукцииИМатериалов.ДобавитьКомандуСоздатьПередачуВПроизводствоНаОснованииЗаказа(КомандыСозданияНаОсновании);
	Если Команда <> Неопределено Тогда
		ПодключаемыеКоманды.ДобавитьУсловиеВидимостиКоманды(Команда, "ПроизводствоНаСтороне", Ложь, ВидСравненияКомпоновкиДанных.Равно);
	КонецЕсли;
    #КонецУдаления
	#Вставка
	//БИТ_Гурьев_ЧТЗ_3.7_06.03.24++
	Если Пользователи.ЭтоПолноправныйПользователь() Тогда
		
		Команда = Документы.ДвижениеПродукцииИМатериалов.ДобавитьКомандуСоздатьПередачуВПроизводствоНаОснованииЗаказа(КомандыСозданияНаОсновании);
		Если Команда <> Неопределено Тогда
			ПодключаемыеКоманды.ДобавитьУсловиеВидимостиКоманды(Команда, "ПроизводствоНаСтороне", Ложь, ВидСравненияКомпоновкиДанных.Равно);
		КонецЕсли;
		
	КонецЕсли;
	Документы.КАНАТ_РезультатИспытаний.ДобавитьКомандуСоздатьРезультатИспытаний(КомандыСозданияНаОсновании);
	//БИТ_Гурьев_ЧТЗ_3.7_06.03.24--
	#КонецВставки
	Команда = Документы.ДвижениеПродукцииИМатериалов.ДобавитьКомандуСоздатьВозвратИзПроизводстваНаОснованииЗаказа(КомандыСозданияНаОсновании);
	Если Команда <> Неопределено Тогда
		ПодключаемыеКоманды.ДобавитьУсловиеВидимостиКоманды(Команда, "ПроизводствоНаСтороне", Ложь, ВидСравненияКомпоновкиДанных.Равно);
	КонецЕсли;

	Документы.РасходныйОрдерНаТовары.ДобавитьКомандуСоздатьНаОснованииРасходныйОрдерНаТовары(КомандыСозданияНаОсновании);

	Документы.ДвижениеПродукцииИМатериалов.ДобавитьКомандуСоздатьПередачуИзПроизводстваНаОснованииЗаказа(КомандыСозданияНаОсновании);

	Документы.КорректировкаНазначенияТоваров.ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании);

	Документы.АктВыполненныхВнутреннихРабот.ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании);

	Документы.ПлановаяКалькуляция2_2.ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании);

	Команда = Документы.ПроизводственнаяОперация2_2.ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании);
	Если Команда <> Неопределено Тогда
		ПодключаемыеКоманды.ДобавитьУсловиеВидимостиКоманды(Команда, "ПроизводствоНаСтороне", Ложь, ВидСравненияКомпоновкиДанных.Равно);
	КонецЕсли;

	Команда = Документы.ЗаказПоставщику.ДобавитьКомандуСоздатьОбеспечивающийЗаказ(КомандыСозданияНаОсновании);
	Если Команда <> Неопределено Тогда
		ПодключаемыеКоманды.ДобавитьУсловиеВидимостиКоманды(Команда, "ПроизводствоНаСтороне", Ложь, ВидСравненияКомпоновкиДанных.Равно);
	КонецЕсли;

	Команда = Документы.ЗаказПоставщику.ДобавитьКомандуСоздатьНаОснованииЗаказыПоставщикам(КомандыСозданияНаОсновании);
	Если Команда <> Неопределено Тогда
		ПодключаемыеКоманды.ДобавитьУсловиеВидимостиКоманды(Команда, "ПроизводствоНаСтороне", Ложь, ВидСравненияКомпоновкиДанных.Равно);
	КонецЕсли;

	Команда = Обработки.СправочноеРазмещениеНоменклатуры.ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании);

	Если Команда <> Неопределено Тогда
		СтатусыДокумента = Новый Массив;
		СтатусыДокумента.Добавить(Перечисления.СтатусыЭтаповПроизводства2_2.Сформирован);
		СтатусыДокумента.Добавить(Перечисления.СтатусыЭтаповПроизводства2_2.КВыполнению);
		СтатусыДокумента.Добавить(Перечисления.СтатусыЭтаповПроизводства2_2.Начат);
		СтатусыДокумента.Добавить(Перечисления.СтатусыЭтаповПроизводства2_2.Завершен);

		ПодключаемыеКоманды.ДобавитьУсловиеВидимостиКоманды(Команда,
		"Статус",
		СтатусыДокумента,
		ВидСравненияКомпоновкиДанных.ВСписке);
	КонецЕсли;

	БизнесПроцессы.Задание.ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании);

	ЭтапПроизводства2_2Локализация.ДобавитьКомандыСозданияНаОсновании(КомандыСозданияНаОсновании, Параметры);

КонецПроцедуры

&ИзменениеИКонтроль("ПродукцияИПолуфабрикатыДляФормированияЭтапов")
Функция КАНАТ_ПродукцияИПолуфабрикатыДляФормированияЭтапов1(МенеджерВременныхТаблиц)

	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	Таблица.Распоряжение КАК Распоряжение,
	|	
	|	Таблица.НазначениеПродукция КАК НазначениеПродукция,
	|	Таблица.НазначениеМатериалы КАК НазначениеМатериалы,
	|	
	|	Таблица.Номенклатура   КАК Номенклатура,
	|	Таблица.Характеристика КАК Характеристика,
	|
	|	Таблица.Отправитель    КАК Отправитель,
	|	Таблица.Получатель     КАК Получатель,
	|	
	|	Таблица.ЭтапИсточник   КАК ЭтапИсточник,
	|	Таблица.Назначение     КАК Назначение,
	|	
	|	Таблица.Спецификация   КАК Спецификация,
	|
	|	Таблица.СписатьНаРасходы         КАК СписатьНаРасходы,
	|	Таблица.СтатьяРасходов           КАК СтатьяРасходов,
	|	Таблица.АналитикаРасходов        КАК АналитикаРасходов,
	|	Таблица.АналитикаАктивовПассивов КАК АналитикаАктивовПассивов,
	|	
	|	Таблица.НомерСтроки    КАК НомерСтроки,
	|	
	|	Таблица.Количество     КАК Количество,
	|	
	|	ВЫРАЗИТЬ(Таблица.Распоряжение КАК Документ.ЗаказНаПроизводство2_2).НачатьНеРанее           КАК ДатаЗапуска,
	|	ВЫРАЗИТЬ(Таблица.Распоряжение КАК Документ.ЗаказНаПроизводство2_2).ДатаПотребности         КАК ДатаВыпуска,
	|	ВЫРАЗИТЬ(Таблица.Распоряжение КАК Документ.ЗаказНаПроизводство2_2).РазмещениеВыпуска       КАК РазмещениеВыпуска,
	|	ВЫРАЗИТЬ(Таблица.Распоряжение КАК Документ.ЗаказНаПроизводство2_2).НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	ВЫРАЗИТЬ(Таблица.Распоряжение КАК Документ.ЗаказНаПроизводство2_2).Подразделение           КАК ПодразделениеДиспетчер,
	|
	|	Таблица.ЭтапИсточник <> ЗНАЧЕНИЕ(Документ.ЭтапПроизводства2_2.ПустаяСсылка)                КАК ОбособитьПодРазобрку 
	#Вставка
	|	,
	|//++ Гурьев 13.09.23 Добавление комментария к заказу
	|	ЕСТЬNULL(Продукция.КАНАТ_КомментарийКЗаказу, """") КАК КАНАТ_КомментарийКЗаказу,
	|	ЕСТЬNULL(Продукция.КАНАТ_Сертификат, """") КАК КАНАТ_Сертификат
	|//-- Гурьев 13.09.23
	|
	#КонецВставки
	|ИЗ
	|	ВтДанныеДляФормированияЭтапов КАК Таблица
	#Вставка
	|//++ Гурьев 13.09.23 Добавление комментария к заказу
	|	ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаказНаПроизводство2_2.Продукция КАК Продукция
	|	ПО (Продукция.Ссылка = Таблица.Распоряжение
	|		И Продукция.НомерСтроки = Таблица.НомерСтроки)
	|//-- Гурьев 13.09.23
	#КонецВставки
	|	
	|ГДЕ
	|	Таблица.Спецификация <> ЗНАЧЕНИЕ(Справочник.РесурсныеСпецификации.ПустаяСсылка)
	|");
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;

	Возврат Запрос.Выполнить().Выгрузить();

КонецФункции
